[
   {
      "Context":"Ben goes swimming every day. Ben is not obliged or required to go swimming; it is just a habit of his. It is now time for Ben to be swimming… so",
      "Sentence":" Ben [MODAL] be swimming (right now)",
      "Expression":"must",
      "Force":"Necessity",
      "Flavor":"Epistemic",
      "polarity":"positive",
      "Index":1
   },
   {
      "Context":"You know that John goes to school at 9am every day. You look at the clock and see it is 9am, therefore ",
      "Sentence":"John [MODAL] be at school",
      "Expression":"must",
      "Force":"Necessity",
      "Flavor":"Epistemic",
      "polarity":"positive",
      "Index":2
   },
   {
      "Context":"The math teacher says: There are 3 boxes.The ball is in box A or in box B or in box C. It is not in A. It is not in B. So,",
      "Sentence":"it [MODAL] be in C",
      "Expression":"must",
      "Force":"Necessity",
      "Flavor":"Epistemic",
      "polarity":"positive",
      "Index":3
   },
   {
      "Context":"Tim is calling for his dog. The dog is not coming. Tim looks for the dog in the kitchen, bedroom, living room, (in every room in the house) but the dog is not in any of those rooms. Therefore, Tim concludes",
      "Sentence":"that the dog [MODAL] not be in the house",
      "Expression":"must",
      "Force":"Necessity",
      "Flavor":"Epistemic",
      "polarity":"positive",
      "Index":4
   },
   {
      "Context":"You know that Ann goes hiking from 7am until 8am every day. Most of the time Ann goes to the lake, but sometimes she goes to the mountains. It is now 7:30am and your friend asks where Ann is. You say to your friend:",
      "Sentence":"Ann [MODAL] be at the lake right now. ",
      "Expression":"should",
      "Force":"Weak Necessity",
      "Flavor":"Epistemic",
      "polarity":"positive",
      "Index":5
   },
   {
      "Context":"(Imagine that) you used to live in Goa. You are not living in Goa anymore. You notice how different the weather is in the UK, where you live right now. You know that it often rains in Goa, especially in the afternoon, but not necessarily every day. Now it’s the afternoon, so you think: ",
      "Sentence":"it [MODAL] be raining now in Goa.",
      "Expression":"should",
      "Force":"Weak Necessity",
      "Flavor":"Epistemic",
      "polarity":"positive",
      "Index":6
   },
   {
      "Context":"When the light is on at Mary’s house, it usually means that she is home. You want to visit Mary. You walk past Mary’s house and notice that the light is on. You think to yourself:",
      "Sentence":"Mary [MODAL] be at home.",
      "Expression":"should",
      "Force":"Weak Necessity",
      "Flavor":"Epistemic",
      "polarity":"positive",
      "Index":7
   },
   {
      "Context":"The teacher is not consistent. The students never know if he’s going to come or not to teach class. Today, it’s time to start class and the students are waiting again.",
      "Sentence":"He [MODAL] be coming to school today.",
      "Expression":"might",
      "Force":"Possibility",
      "Flavor":"Epistemic",
      "polarity":"positive",
      "Index":8
   },
   {
      "Context":"Grace is looking for her necklace. She looks in her wardrobe and on top of the wardrobe. It’s not there. She looks on top of the TV. It’s not there. She looks in her backpack. It’s not there. However, she has not checked two other places. She hasn’t checked her sister’s wardrobe yet. She hasn’t checked the car either.",
      "Sentence":"Grace’s necklace [MODAL] be lost.",
      "Expression":"might",
      "Force":"Possibility",
      "Flavor":"Epistemic",
      "polarity":"positive",
      "Index":9
   },
   {
      "Context":"Charles is looking for his pet cat, but cannot find it. He knows that his cat is very elusive and mysterious. Charles tells his sister:",
      "Sentence":"The cat [MODAL] be inside. The cat [MODAL] also be outside.",
      "Expression":"may",
      "Force":"Possibility",
      "Flavor":"Epistemic",
      "polarity":"positive",
      "Index":10
   },
   {
      "Context":"Daniel lives in London and his friend has recently moved to New York. Daniel’s parents told him that he is not allowed to go and see his friend in New York because it is too far away. You heard that Daniel is leaving London next week but you don’t know where he will go. Daniel usually does things that he is not permitted to do.",
      "Sentence":"You think Daniel [MODAL] go to New York.",
      "Expression":"might",
      "Force":"Possibility",
      "Flavor":"Epistemic",
      "polarity":"positive",
      "Index":11
   },
   {
      "Context":"In Indonesia, the law states that when you ride a motor bike…",
      "Sentence":"You [MODAL] wear a helmet.",
      "Expression":"must",
      "Force":"Necessity",
      "Flavor":"Deontic",
      "polarity":"positive",
      "Index":12
   },
   {
      "Context":"You are going to visit your friend in the hospital. When you enter into the hospital, you stop at the information desk to inquire what room your friend is in. But the woman at the information desk tells you that you can’t visit your friend now because it’s already 8pm. She says, “I’m sorry, the hospital regulations say that: ",
      "Sentence":"Visitors [MODAL] leave by 6pm.",
      "Expression":"must",
      "Force":"Necessity",
      "Flavor":"Deontic",
      "polarity":"positive",
      "Index":13
   },
   {
      "Context":"Your friend is having a birthday party. She tells you that she would like it if everyone invited wore formal clothes, but that it is not necessary to wear formal clothes to attend. You think to yourself…",
      "Sentence":"I [MODAL] wear formal clothes to the party.",
      "Expression":"ought to",
      "Force":"Weak Necessity",
      "Flavor":"Deontic",
      "polarity":"positive",
      "Index":16
   },
   {
      "Context":"Your friend tells you that the rules of the restaurant state that employees must wash their hands after going to the bathroom. You reply to your friend:",
      "Sentence":"Non-employees [MODAL] wash their hands too!",
      "Expression":"ought to",
      "Force":"Weak Necessity",
      "Flavor":"Deontic",
      "polarity":"positive",
      "Index":17
   },
   {
      "Context":"In England, it is recommended that face coverings be worn in stores, but it is not a legal requirement. You plan on going shopping, and you think to yourself",
      "Sentence":"I [MODAL] wear a face covering.",
      "Expression":"ought to",
      "Force":"Weak Necessity",
      "Flavor":"Deontic",
      "polarity":"positive",
      "Index":18
   },
   {
      "Context":"The ferris wheel ride is only for children under 12 years of age. Martin is 10 years of age. It is not obligatory for Martin to go on the ride if he doesn’t want to, but",
      "Sentence":"Martin [MODAL] ride the ferris wheel.",
      "Expression":"may",
      "Force":"Possibility",
      "Flavor":"Deontic",
      "polarity":"positive",
      "Index":19
   },
   {
      "Context":"According to the rules of the hospital, only family members are allowed to enter the patient’s room during visiting hours. You came to visit your sister after visiting hours. But the really nice nurse says: ",
      "Sentence":"You [MODAL] enter.",
      "Expression":"may",
      "Force":"Possibility",
      "Flavor":"Deontic",
      "polarity":"positive",
      "Index":20
   },
   {
      "Context":"You are making plans for tomorrow night to meet up with your friend. Your friend says:",
      "Sentence":"You [MODAL] stay overnight or you [MODAL] go home.",
      "Expression":"can",
      "Force":"Possibility",
      "Flavor":"Deontic",
      "polarity":"positive",
      "Index":21
   },
   {
      "Context":"Alice fell down the stairs and broke her arm a while ago. She hasn’t been lifting her baby while her arm was hurt because the baby is heavy. Finally, she has recovered, and she went to the doctor for a final check-up. The doctor gave her permission to lift her baby. But when she got home after her visit to the doctor, Alice found that she is still too weak to lift her baby, although according to the doctor’s orders, ",
      "Sentence":"Alice [MODAL] lift her baby.",
      "Expression":"can",
      "Force":"Possibility",
      "Flavor":"Deontic",
      "polarity":"positive",
      "Index":22
   },
   {
      "Context":"Beth’s teacher told her class that it was okay to go swimming, but Beth doesn’t want to because she has never learnt to swim! However, as far as the teacher’s directions are concerned, ",
      "Sentence":"Beth [MODAL] go swimming.",
      "Expression":"can",
      "Force":"Possibility",
      "Flavor":"Deontic",
      "polarity":"positive",
      "Index":23
   },
   {
      "Context":"There is only one main road from Location A to Location B… If you go from Location A to Location B,",
      "Sentence":"you [MODAL] take this road.",
      "Expression":"have to",
      "Force":"Necessity",
      "Flavor":"Teleological",
      "polarity":"positive",
      "Index":24
   },
   {
      "Context":"Team A are playing in a tournament. In order to advance, ",
      "Sentence":"Team A [MODAL] beat Team B.",
      "Expression":"have to",
      "Force":"Necessity",
      "Flavor":"Teleological",
      "polarity":"positive",
      "Index":25
   },
   {
      "Context":"The best pizza in town is sold at Gino’s. You have invited your sister for dinner, and you decide to order pizza. You tell your sister:",
      "Sentence":"We [MODAL] order from Gino’s to eat the best pizza.",
      "Expression":"have to",
      "Force":"Necessity",
      "Flavor":"Teleological",
      "polarity":"positive",
      "Index":26
   },
   {
      "Context":"There are different ways to get to the shopping centre. You can go by foot, by bus, or drive yourself. You are not sure how to go. Your friend advises you to get the bus because it is cheaper.",
      "Sentence":"To get to the shopping centre, you [MODAL] take the bus.",
      "Expression":"should",
      "Force":"Weak Necessity",
      "Flavor":"Teleological",
      "polarity":"positive",
      "Index":27
   },
   {
      "Context":"There are 3 ways to get to the seaside: a direct road, taking smaller roads, or a combination. Your friend says that taking the smaller roads is very beautiful. According to him,",
      "Sentence":"you [MODAL] go via the smaller roads.",
      "Expression":"should",
      "Force":"Weak Necessity",
      "Flavor":"Teleological",
      "polarity":"positive",
      "Index":28
   },
   {
      "Context":"Your friend wants to buy a new shirt for her job at a reasonable price. There are many nice shops for professional clothes in the area, and you work at one of them and think it offers good prices. You say:",
      "Sentence":"You [MODAL] go to my shop to buy a new shirt.",
      "Expression":"should",
      "Force":"Weak Necessity",
      "Flavor":"Teleological",
      "polarity":"positive",
      "Index":29
   },
   {
      "Context":"There are two different ways to get to the mountains from the city centre. Way 1 is inland and way 2 goes around via the coast. Both take around 7 hours by bus and they are equally beautiful.",
      "Sentence":"You [MODAL] take way 1.",
      "Expression":"can",
      "Force":"Possibility",
      "Flavor":"Teleological",
      "polarity":"positive",
      "Index":30
   },
   {
      "Context":"There are two swimming pools in the town with the exact same design and both are an equal distance from your house. You plan to go swimming later on but have no specific desire for which pool to go to. You tell your sister:",
      "Sentence":"We [MODAL] go to the swimming pool to the west.",
      "Expression":"can",
      "Force":"Possibility",
      "Flavor":"Teleological",
      "polarity":"positive",
      "Index":31
   },
   {
      "Context":"Your friend wants to buy a new shirt for her job. Since there are many nice shops for professional clothes in the area, you say:",
      "Sentence":"You [MODAL] go to this boutique.",
      "Expression":"can",
      "Force":"Possibility",
      "Flavor":"Teleological",
      "polarity":"positive",
      "Index":32
   },
   {
      "Context":"You are on a bus. You have not had a chance to go to the toilet for 4 hours, and your bladder is full. You text your friend:",
      "Sentence":"I [MODAL] pee so badly!",
      "Expression":"have to",
      "Force":"Necessity",
      "Flavor":"Circumstantial",
      "polarity":"positive",
      "Index":33
   },
   {
      "Context":"In the middle of a conversation, you feel a sneeze coming on… Excuse me!",
      "Sentence":"I [MODAL] sneeze.",
      "Expression":"have to",
      "Force":"Necessity",
      "Flavor":"Circumstantial",
      "polarity":"positive",
      "Index":34
   },
   {
      "Context":"Water is entering a pipe, which has two outputs: the left output and the right output. You block the left output so that",
      "Sentence":"the water [MODAL] come out from the right output.",
      "Expression":"must",
      "Force":"Necessity",
      "Flavor":"Circumstantial",
      "polarity":"positive",
      "Index":35
   },
   {
      "Context":"Ani came to visit a small island in the Philippines. She noticed that the climate and many of the plants are similar to some places she visited in Indonesia, where duku trees grow. The temperature is the same, the rainfall is the same, the types of rocks and the soil are the same. But when she looked around, she didn’t find any duku trees anywhere. But because the temperature, rainfall, and soil are the same, she thinks that…",
      "Sentence":"duku trees [MODAL] grow here.",
      "Expression":"can",
      "Force":"Possibility",
      "Flavor":"Circumstantial",
      "polarity":"positive",
      "Index":36
   },
   {
      "Context":"Amy was in Italy and learned how to make traditional Italian pasta. Now Amy is back in the country she lives in, and she wants to make traditional pasta, but the right kind of ingredients are not sold where she lives. So, she is unhappy because she wanted to show her parents how to make traditional pasta.",
      "Sentence":"Amy [MODAL] make traditional Italian pasta (but she does not have the ingredients).",
      "Expression":"can",
      "Force":"Possibility",
      "Flavor":"Circumstantial",
      "polarity":"positive",
      "Index":37
   },
   {
      "Context":"Ben was in a motorbike accident 3 weeks ago, and he sprained his ankle. Ben is able to walk now. However, the doctor told Ben that he is not allowed to walk until 5 weeks after the accident.",
      "Sentence":"Ben [MODAL] walk now.",
      "Expression":"can",
      "Force":"Possibility",
      "Flavor":"Circumstantial",
      "polarity":"positive",
      "Index":38
   },
   {
      "Context":"Paul is quite old now, but he is still strong. His children are scared he will hurt his back if he does any intense labour, so they told him that he is forbidden to lift heavy things. But one day, his friend Rob asked to help him in the field, because Rob knows Paul is still strong. So when Rob saw a large rock that had to be moved, he asked Paul straightaway for help (but he didn’t tell Paul’s children!). Rob knew that…",
      "Sentence":"Paul [MODAL] lift that rock.",
      "Expression":"can",
      "Force":"Possibility",
      "Flavor":"Circumstantial",
      "polarity":"positive",
      "Index":39
   },
   {
      "Context":"The travel vans have a limit of 13 people by law. But the drivers don’t care, and stop for more than 13 people. Also, the vans are bigger than you think.",
      "Sentence":"Travel vans [MODAL] fit 20 people.",
      "Expression":"can",
      "Force":"Possibility",
      "Flavor":"Circumstantial",
      "polarity":"positive",
      "Index":40
   },
   {
      "Context":"You love handbags. You see a really nice handbag in a window and you say:",
      "Sentence":"I [MODAL] buy it.",
      "Expression":"must",
      "Force":"Necessity",
      "Flavor":"Bouletic",
      "polarity":"positive",
      "Index":41
   },
   {
      "Context":"Your friend asks you what you want to do today since it is a holiday and you both are not required to do any tasks today. However, you absolutely want to see this new movie that everyone is talking about. You say:",
      "Sentence":"I [MODAL] go to the cinema.",
      "Expression":"must",
      "Force":"Necessity",
      "Flavor":"Bouletic",
      "polarity":"positive",
      "Index":42
   },
   {
      "Context":"A daughter tells her parent...",
      "Sentence":"My friend [MODAL] come visit me.",
      "Expression":"want to",
      "Force":"Necessity",
      "Flavor":"Bouletic",
      "polarity":"positive",
      "Index":43
   },
   {
      "Context":"When the light is on at Mary’s house, it usually means that she is home. You want to visit Mary. You walk past Mary’s house and notice that the light is on. However, there is no car in the driveway. You think to yourself:",
      "Sentence":"Mary [MODAL] not be at home.",
      "Expression":"may",
      "Force":"Necessity",
      "Flavor":"Epistemic",
      "polarity":"negative",
      "Index":-7
   },
   {
      "Context":"Ben goes swimming every day. Ben is not obliged or required to go swimming; it is just a habit of his. It is now time for Ben to be swimming, so...",
      "Sentence":"Ben [MODAL] not be at home. ",
      "Expression":"can",
      "Force":"Possibility",
      "Flavor":"Epistemic",
      "polarity":"negative",
      "Index":-1
   },
   {
      "Context":"The math teacher says: There are 3 boxes. The ball is in box A or in box B or in box C. We opened box A, and the ball is there. There is only one ball. So,",
      "Sentence":"it [MODAL] not be in C.",
      "Expression":"can",
      "Force":"Possibility",
      "Flavor":"Epistemic",
      "polarity":"negative",
      "Index":-3
   },
   {
      "Context":"Your friend is having a birthday party. She tells you that she would like it if everyone invited wore formal clothes, but that it is not necessary to wear formal clothes to attend. You think to yourself… I ought to wear formal clothes to the party, but",
      "Sentence 1":"I don’t [MODAL] wear formal clothes.",
      "Expression":"have to",
      "Force":"Necessity",
      "Flavor":"Deontic",
      "polarity":"negative",
      "Index":-16
   },
   {
      "Context":"In England, it is recommended that face coverings be worn in stores, but it is not a legal requirement. You plan on going shopping, and you think to yourself… I ought to wear a face covering, but",
      "Sentence":" I don't [MODAL] wear a face covering.",
      "Expression":"need to",
      "Force":"Necessity",
      "Flavor":"Deontic",
      "polarity":"negative",
      "Index":-18
   },
   {
      "Context":"In Indonesia, the law states that when you ride a motor bike,",
      "Sentence":"You [MODAL] not ride a motor bike without a helmet.",
      "Expression":"must",
      "Force":"Possibility",
      "Flavor":"Deontic",
      "polarity":"negative",
      "Index":-12
   },
   {
      "Context":"You are going to visit your friend in the hospital. When you enter into the hospital, you stop at the information desk to inquire what room your friend is in. But the woman at the information desk tells you that you can’t visit your friend now because it’s already 8pm. She says, “I’m sorry, the hospital regulations say that...",
      "Sentence":"Visitors [MODAL] not stay after 6pm.",
      "Expression":"must",
      "Force":"Possibility",
      "Flavor":"Deontic",
      "polarity":"negative",
      "Index":-13
   },
   {
      "Context":"There are different ways to get to the shopping centre. You can go by foot, by bus, or drive yourself. You are not sure how to go. Your friend advises you to get the bus because it is cheaper… To get to the shopping centre, you should take the bus, but",
      "Sentence":"you don’t [MODAL] take the bus",
      "Expression":"need to",
      "Force":"Necessity",
      "Flavor":"Teleological",
      "polarity":"negative",
      "Index":-27
   },
   {
      "Context":"There is only one main road from Location A to Location B… If you are going from Location A to Location B,",
      "Sentence":"you [MODAL] not take another road.",
      "Expression":"can",
      "Force":"Possibility",
      "Flavor":"Teleological",
      "polarity":"negative",
      "Index":-24
   },
   {
      "Context":"Team A are playing in a tournament. In order to advance,",
      "Sentence":"Team A [MODAL] not lose to Team B.",
      "Expression":"can",
      "Force":"Necessity",
      "Flavor":"Deontic",
      "polarity":"negative",
      "Index":-25
   },
   {
      "Context":"Given the way this volcano has been active in the past 100 years, it is likely but not certain that it will erupt in the next 5 years. ",
      "Sentence":"The volcano doesn’t [MODAL] erupt.",
      "Expression":"have to",
      "Force":"Necessity",
      "Flavor":"Circumstantial",
      "polarity":"negative",
      "Index":44
   },
   {
      "Context":"Ben was in a motorbike accident 3 weeks ago. He sprained his ankle and is in a lot of pain. ",
      "Sentence":"Ben [MODAL] not walk.",
      "Expression":"can",
      "Force":"Possibility",
      "Flavor":"Circumstantial",
      "polarity":"negative",
      "Index":-34
   },
   {
      "Context":"Water is entering a pipe, which has two outputs: the left output and the right output. But, you know that the left output is blocked. And the water is coming out from the right output. You say: ",
      "Sentence":"the water [MODAL] not come out from the left output. ",
      "Expression":"can",
      "Force":"Possibility",
      "Flavor":"Circumstantial",
      "polarity":"negative",
      "Index":-35
   },
   {
      "Context":"Ani came to visit a small Caribbean island. She noticed that the climate and many of the plants are very different to the places she visited in Indonesia, where duku trees grow. The types of rocks and the soil are different as well. She doesn’t know whether or not there are duku trees on the island. But because the temperature, rainfall, and soil are so different, she thinks that…",
      "Sentence":"duku trees [MODAL] not grow here.",
      "Expression":"can",
      "Force":"Possibility",
      "Flavor":"Circumstantial",
      "polarity":"negative",
      "Index":-36
   }

]
